won-jong-wan/SYNTH_RTOS_BLACKPILL/SYNTH_RTOS_STM32F411CEU6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Rotary2_S1_Pin GPIO_PIN_13
#define Rotary2_S1_GPIO_Port GPIOB
#define Rotary2_S1_EXTI_IRQn EXTI15_10_IRQn
#define Rotary2_S2_Pin GPIO_PIN_14
#define Rotary2_S2_GPIO_Port GPIOB
#define Rotary2_S2_EXTI_IRQn EXTI15_10_IRQn
#define Rotary2_KEY_Pin GPIO_PIN_15
#define Rotary2_KEY_GPIO_Port GPIOB
#define Rotary2_KEY_EXTI_IRQn EXTI15_10_IRQn
#define Rotary1_S1_Pin GPIO_PIN_6
#define Rotary1_S1_GPIO_Port GPIOB
#define Rotary1_S1_EXTI_IRQn EXTI9_5_IRQn
#define Rotary1_S2_Pin GPIO_PIN_7
#define Rotary1_S2_GPIO_Port GPIOB
#define Rotary1_S2_EXTI_IRQn EXTI9_5_IRQn
#define Rotary1_KEY_Pin GPIO_PIN_8
#define Rotary1_KEY_GPIO_Port GPIOB
#define Rotary1_KEY_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
